In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
import matplotlib.pyplot as plt

In [4]:
from sklearn import linear_model

In [25]:
from word2number import w2n

In [5]:
df = pd.read_csv("hiring.csv")

In [6]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
df["experience"] = df.experience.fillna("three")

In [11]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0      three                    8.0                           9      50000
1      three                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [12]:
import math

In [13]:
df["test_score(out of 10)"] = df["test_score(out of 10)"].fillna(df.median())

C:\Users\User\AppData\Local\Temp\ipykernel_9944\1870094321.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df["test_score(out of 10)"] = df["test_score(out of 10)"].fillna(df.median())

In [14]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0      three                    8.0                           9      50000
1      three                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [16]:
mean = math.floor(df["test_score(out of 10)"].mean())

In [17]:
mean

7

In [18]:
df["test_score(out of 10)"] = df["test_score(out of 10)"].fillna(mean)

In [19]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0      three                    8.0                           9      50000
1      three                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    7.0                           7      72000
7     eleven                    7.0                           8      80000

In [27]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           3                    8.0                           9      50000
1           3                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [28]:
df_new = df.drop("salary($)" , axis = "columns")

In [29]:
df_new

   experience  test_score(out of 10)  interview_score(out of 10)
0           3                    8.0                           9
1           3                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    7.0                           7
7          11                    7.0                           8

In [31]:
salary = df["salary($)"]

In [32]:
salary

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [33]:
model = linear_model.LinearRegression()

In [34]:
model

LinearRegression()

In [37]:
model.fit(df_new , salary)

LinearRegression()

In [38]:
model.predict([[2,9,10]])

C:\Users\User\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([59902.43902439])

In [39]:
model.predict([[12 , 10 , 10]])

C:\Users\User\Anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([97380.48780488])

In [40]:
model.score(df_new , salary)

0.8297107938681978